In [1]:
import os

In [3]:
os.getcwd()

'C:\\Users\\hanis'

In [4]:
import pandas as pd

In [5]:
pd.read_excel(r'TODAYPROJECT.xlsx')

    name   number class rank
0   madhu     105  10th    A
1  SARATH     106  10th    B
2   VARUN     107  10TH  A++
3   VAANI     108  10TH    O

In [6]:
pd.read_csv(r'TODAYPROJECT2.csv')

     name   number class rank
0    madhu     105  10th    A
1   SARATH     106  10th    B
2    VARUN     107  10TH  A++
3    VAANI     108  10TH    O
4  krishna     109  10th  O++
5   PRASAD     110  10TH  A++

In [8]:
pd.read_csv(r'todayproject.tsv',sep='\t')

    name  number organisation grade
0  sunil   89775  datascience     a
1  madhu   89775  datascience     b
2  kiran   85858  datascience     c